lib/tasks/import.rake

    task articles: :environment do



        csv_text = Rails.root.join('lib', 'seeds', 'import.csv')
        CSV.foreach(csv_text, headers: true) do |row|

            Article.create(article_id: row['id'], title: row['title'], description: row['description'], author: row['author'], tags: row['tags'])
---
INSERT INTO "articles" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-01-10 01:43:13.737389"], ["updated_at", "2019-01-10 01:43:13.737389"]]