app/controllers/api/v1/articles_controller.rb

      def show
        render json: @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def create
        @article = Article.create(article_params)
---
INSERT INTO "articles" ("title", "description", "author", "tags", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdasd"], ["description", "addasd"], ["author", "adadsd"], ["tags", "asdas"], ["created_at", "2019-01-13 21:56:49.954735"], ["updated_at", "2019-01-13 21:56:49.954735"]]